DEV_62/DEV62/src/Documents/ПродажиТоваров/ПродажиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПродажиТоваров</name>
  <tabularSections>
    <name>СписокТоваров</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

DEV_62/DEV62/src/Documents/ПродажиТоваров/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура СписокТоваровКоличествоПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.СписокТоваров.ТекущиеДанные;
	ПересчитатьСуммуВСтрокеТЧ(ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровЦенаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.СписокТоваров.ТекущиеДанные;
	ПересчитатьСуммуВСтрокеТЧ(ТекущаяСтрока);
КонецПроцедуры


#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций
&НаКлиенте
Процедура ПересчитатьСуммуВСтрокеТЧ(ТекущаяСтрока)
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;  
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыФорма

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
